www/app/Controllers/Auth.php

    public function signin()
{
    ini_set('display_errors', '1');
    error_reporting(E_ALL);

    $model = new \App\Models\UserModel();
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'divij@gmail.com'
 LIMIT 1

    public function signup()
    {
        $rules = [
            'email'        => 'required|valid_email|is_unique[users.email]',
            'password'     => 'required|min_length[8]',
            'pass_confirm' => 'required|matches[password]',
        ];

        if (!$this->validate($rules)) {
            return view('auth/signup', ['validation' => $this->validator]);
        }

        $model = new \App\Models\UserModel();
        $model->save([
            'email'    => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        ]);
---
INSERT INTO `users` (`email`, `password`, `created_at`, `updated_at`) VALUES ('divij@gmail.com', '$2y$12$n6xrBai8aqu9ifipASg/9.0psigukJSmWBc7yoW4svBbRkXyXdB.i', '2026-07-05 19:27:40', '2026-07-05 19:27:40')