www/app/Controllers/Home.php

    public function index()
    {
        $userId = session()->get('userId');
        $db = \Config\Database::connect();
        $tasks = $db->table('tasks')
            ->select('tasks.*, subjects.name as subject_name')
            ->join('subject_tasks', 'subject_tasks.task_id = tasks.id')
            ->join('subjects', 'subjects.id = subject_tasks.subject_id')
            ->where('tasks.user_id', $userId)
            ->orderBy('tasks.deadline', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `tasks`.*, `subjects`.`name` as `subject_name`
FROM `tasks`
JOIN `subject_tasks` ON `subject_tasks`.`task_id` = `tasks`.`id`
JOIN `subjects` ON `subjects`.`id` = `subject_tasks`.`subject_id`
WHERE `tasks`.`user_id` = '2'
ORDER BY `tasks`.`deadline` ASC