www/app/Controllers/Profile.php

    public function index()
{
    $model = new UserModel();
    $user = $model->find(session()->get('userId'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'