www/app/Controllers/Subjects.php

SELECT *
FROM `subjects`
WHERE `user_id` = '2'
---
    public function index()
    {
        $model = new SubjectModel();
        // Fetch only subjects belonging to the currently logged-in user
        $data['subjects'] = $model->where('user_id', session()->get('userId'))->findAll();