www/app/Controllers/Summaries.php

SELECT `summaries`.*, `subjects`.`name` as `subject_name`
FROM `summaries`
LEFT JOIN `subject_summaries` ON `subject_summaries`.`summary_id` = `summaries`.`id`
LEFT JOIN `subjects` ON `subjects`.`id` = `subject_summaries`.`subject_id`
WHERE `summaries`.`user_id` = '2'
---
public function index()
{
    $db = \Config\Database::connect();
    $summaries = $db->table('summaries')
        ->select('summaries.*, subjects.name as subject_name')
        ->join('subject_summaries', 'subject_summaries.summary_id = summaries.id', 'left')
        ->join('subjects', 'subjects.id = subject_summaries.subject_id', 'left')
        ->where('summaries.user_id', session()->get('userId'))
        ->get()
        ->getResultArray();