www/app/Controllers/Tasks.php

SELECT `tasks`.*, `subjects`.`name` as `subject_name`
FROM `tasks`
JOIN `subject_tasks` ON `subject_tasks`.`task_id` = `tasks`.`id`
JOIN `subjects` ON `subjects`.`id` = `subject_tasks`.`subject_id`
WHERE `tasks`.`user_id` = '2'
---
    public function index()
    {
        $db = \Config\Database::connect();
        $tasks = $db->table('tasks')
            ->select('tasks.*, subjects.name as subject_name')
            ->join('subject_tasks', 'subject_tasks.task_id = tasks.id')
            ->join('subjects', 'subjects.id = subject_tasks.subject_id')
            ->where('tasks.user_id', session()->get('userId'))
            ->get()
            ->getResultArray();

SELECT *
FROM `subjects`
WHERE `user_id` = '2'
---
    public function create()
    {
        $subjectModel = new SubjectModel();
        $data['subjects'] = $subjectModel->where('user_id', session()->get('userId'))->findAll();